{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"name": "input_54", "config": {"dtype": "float32", "name": "input_54", "batch_input_shape": [null, 200], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_55", "config": {"dtype": "float32", "name": "input_55", "batch_input_shape": [null, 200], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_44", "config": {"dtype": "float32", "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "activity_regularizer": null, "embeddings_regularizer": null, "input_dim": 5000, "mask_zero": false, "output_dim": 200, "batch_input_shape": [null, 200], "name": "embedding_44", "trainable": true, "input_length": 200}, "class_name": "Embedding", "inbound_nodes": [[["input_54", 0, 0, {}]]]}, {"name": "embedding_45", "config": {"dtype": "float32", "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "activity_regularizer": null, "embeddings_regularizer": null, "input_dim": 5000, "mask_zero": false, "output_dim": 200, "batch_input_shape": [null, 200], "name": "embedding_45", "trainable": true, "input_length": 200}, "class_name": "Embedding", "inbound_nodes": [[["input_55", 0, 0, {}]]]}, {"name": "dropout_43", "config": {"trainable": true, "name": "dropout_43", "seed": null, "rate": 0.1, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["embedding_44", 0, 0, {}]]]}, {"name": "dropout_44", "config": {"trainable": true, "name": "dropout_44", "seed": null, "rate": 0.1, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["embedding_45", 0, 0, {}]]]}, {"name": "conv1d_29", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_size": [3], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "dilation_rate": [1], "name": "conv1d_29", "data_format": "channels_last", "trainable": true, "filters": 200, "activation": "relu"}, "class_name": "Conv1D", "inbound_nodes": [[["dropout_43", 0, 0, {}]]]}, {"name": "conv1d_30", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_size": [3], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "dilation_rate": [1], "name": "conv1d_30", "data_format": "channels_last", "trainable": true, "filters": 200, "activation": "relu"}, "class_name": "Conv1D", "inbound_nodes": [[["dropout_44", 0, 0, {}]]]}, {"name": "global_max_pooling1d_31", "config": {"name": "global_max_pooling1d_31", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["conv1d_29", 0, 0, {}]]]}, {"name": "global_max_pooling1d_32", "config": {"name": "global_max_pooling1d_32", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["conv1d_30", 0, 0, {}]]]}, {"name": "dense_45", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "units": 100, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_45", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["global_max_pooling1d_31", 0, 0, {}]]]}, {"name": "dense_46", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "units": 100, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_46", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["global_max_pooling1d_32", 0, 0, {}]]]}, {"name": "concatenate_12", "config": {"name": "concatenate_12", "trainable": true, "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["dense_45", 0, 0, {}], ["dense_46", 0, 0, {}]]]}, {"name": "dropout_45", "config": {"trainable": true, "name": "dropout_45", "seed": null, "rate": 0.1, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["concatenate_12", 0, 0, {}]]]}, {"name": "dense_47", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "units": 100, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_47", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_45", 0, 0, {}]]]}, {"name": "dropout_46", "config": {"trainable": true, "name": "dropout_46", "seed": null, "rate": 0.1, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["dense_47", 0, 0, {}]]]}, {"name": "dense_48", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "units": 672, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_48", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_46", 0, 0, {}]]]}], "output_layers": [["dense_48", 0, 0]], "name": "model_10", "input_layers": [["input_54", 0, 0], ["input_55", 0, 0]]}, "class_name": "Model"}